In [2]:
import pandas as pd

In [7]:
pwd

'F:\\Machine Learning\\Udemy - complete-guide-to-tensorflow-for-deep-learning-with-python\\TensorFlow Bootcamp\\00-Crash-Course-Basics'

In [9]:
df = pd.read_csv('salaries.csv')

In [10]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [13]:
df['Name']

0      John
1     Sally
2    Alyssa
Name: Name, dtype: object

In [14]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [16]:
df[['Name','Salary']]

     Name  Salary
0    John   50000
1   Sally  120000
2  Alyssa   80000

In [18]:
df['Salary'].mean()

83333.333333333328

In [19]:
df['Age']>30

0     True
1     True
2    False
Name: Age, dtype: bool

In [20]:
filter = df['Age']>30

In [21]:
df[filter]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

In [22]:
df[df['Age']>30]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

In [23]:
df.as_matrix

<bound method NDFrame.as_matrix of      Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27>